//
//  Texts.swift
//  MyHabits2
//
//  Created by Oleg Popov on 21.09.2022.
//

import Foundation
import UIKit

enum Text {
  static var alarmMessage = "Вы хотите удалить привычку"

  static var HabitPlace = "fromNewHabbit"
  static var detailPlace = "fromDetailsViewController"
  static var detailsTableTitile = "АКТИВНОСТЬ"
    
  static var leftHabitButton = "Отменить"
  static var rightHabitButton = "Сохранить"
    
  static var deleilRightButton = "Правка"
  
  static var AddHabitTitile = "Создать"
  static var habitNavTitle = "Правка"
  static var toomorowNavTitile = "Сегодня"
  static var infoNavTitle = "Информация"
  static var titleForInfo : String = "Привычка за 21 день"
  static var textForInfo : String = """
 Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:

1. Провести 1 день без обращения
к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага.

2. Выдержать 2 дня в прежнем состоянии самоконтроля.

3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться.

4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств.

5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой.

6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся.
"""

}
